In [1]:
import numpy as np
import pandas as pd

In [4]:
lis=[1,2,3]
d={'a':1,'b':2,'c':3}
ind=['a','b','c']

In [5]:
pd.Series(data=lis)

0    1
1    2
2    3
dtype: int64

In [6]:
pd.Series(data=lis,index=ind)

a    1
b    2
c    3
dtype: int64

In [7]:
a=pd.Series(data=lis,index=ind)

In [8]:
a['a']

1

In [9]:
a['b']

2

In [10]:
a['c']

3

In [11]:
a[1]

2

In [14]:
d

{'a': 1, 'b': 2, 'c': 3}

In [15]:
pd.Series(d)

a    1
b    2
c    3
dtype: int64

In [16]:
ind

['a', 'b', 'c']

In [17]:
pd.Series(data=ind)

0    a
1    b
2    c
dtype: object

In [21]:
pd.Series(data=[2,3.5,5,6,'nirmal'],index=['a','b','c','d','e'])

a         2
b       3.5
c         5
d         6
e    nirmal
dtype: object

In [23]:
ser1=pd.Series([1,2,3],['usa','germany','australia'])

In [24]:
ser1

usa          1
germany      2
australia    3
dtype: int64

In [25]:
ser1['usa']

1

In [32]:
ser2=pd.Series([1,3],['usa','germany'])

In [33]:
ser2

usa        1
germany    3
dtype: int64

In [34]:
ser1 + ser2

australia    NaN
germany      5.0
usa          2.0
dtype: float64

In [54]:
np.random.seed(101)

In [41]:
np.random.randn(5,4)

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [55]:
df= pd.DataFrame(np.random.randn(5,4),['A','B','C','D','row5'],['col1','col2','col3','col4'])

In [56]:
df

          col1      col2      col3      col4
A     2.706850  0.628133  0.907969  0.503826
B     0.651118 -0.319318 -0.848077  0.605965
C    -2.018168  0.740122  0.528813 -0.589001
D     0.188695 -0.758872 -0.933237  0.955057
row5  0.190794  1.978757  2.605967  0.683509

In [57]:
type(df)

pandas.core.frame.DataFrame

In [58]:
df['col1']

A       2.706850
B       0.651118
C      -2.018168
D       0.188695
row5    0.190794
Name: col1, dtype: float64

In [59]:
type(df['col1'])

pandas.core.series.Series

In [61]:
df[['col1','col2']]

          col1      col2
A     2.706850  0.628133
B     0.651118 -0.319318
C    -2.018168  0.740122
D     0.188695 -0.758872
row5  0.190794  1.978757

In [64]:
df.col1
# this is highly not recommended to use rather use df['col']

A       2.706850
B       0.651118
C      -2.018168
D       0.188695
row5    0.190794
Name: col1, dtype: float64

In [65]:
df['col1']

A       2.706850
B       0.651118
C      -2.018168
D       0.188695
row5    0.190794
Name: col1, dtype: float64

In [66]:
df['new'] = df['col1']+df['col2']

In [67]:
df

          col1      col2      col3      col4       new
A     2.706850  0.628133  0.907969  0.503826  3.334983
B     0.651118 -0.319318 -0.848077  0.605965  0.331800
C    -2.018168  0.740122  0.528813 -0.589001 -1.278046
D     0.188695 -0.758872 -0.933237  0.955057 -0.570177
row5  0.190794  1.978757  2.605967  0.683509  2.169552

In [69]:
df.drop('new',axis=1)

          col1      col2      col3      col4
A     2.706850  0.628133  0.907969  0.503826
B     0.651118 -0.319318 -0.848077  0.605965
C    -2.018168  0.740122  0.528813 -0.589001
D     0.188695 -0.758872 -0.933237  0.955057
row5  0.190794  1.978757  2.605967  0.683509

In [71]:
df.head(2)

       col1      col2      col3      col4       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800

In [72]:
df.drop('new',axis=1,inplace=True)

In [73]:
df

          col1      col2      col3      col4
A     2.706850  0.628133  0.907969  0.503826
B     0.651118 -0.319318 -0.848077  0.605965
C    -2.018168  0.740122  0.528813 -0.589001
D     0.188695 -0.758872 -0.933237  0.955057
row5  0.190794  1.978757  2.605967  0.683509

In [75]:
df.describe()

           col1      col2      col3      col4
count  5.000000  5.000000  5.000000  5.000000
mean   0.343858  0.453764  0.452287  0.431871
std    1.681131  1.061385  1.454516  0.594708
min   -2.018168 -0.758872 -0.933237 -0.589001
25%    0.188695 -0.319318 -0.848077  0.503826
50%    0.190794  0.628133  0.528813  0.605965
75%    0.651118  0.740122  0.907969  0.683509
max    2.706850  1.978757  2.605967  0.955057

In [77]:
df.drop('row5')

       col1      col2      col3      col4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [78]:
df

          col1      col2      col3      col4
A     2.706850  0.628133  0.907969  0.503826
B     0.651118 -0.319318 -0.848077  0.605965
C    -2.018168  0.740122  0.528813 -0.589001
D     0.188695 -0.758872 -0.933237  0.955057
row5  0.190794  1.978757  2.605967  0.683509

In [79]:
df.shape

(5, 4)

In [89]:
df[:1]

      col1      col2      col3      col4
A  2.70685  0.628133  0.907969  0.503826

In [85]:
df.loc['A']

col1    2.706850
col2    0.628133
col3    0.907969
col4    0.503826
Name: A, dtype: float64

In [91]:
df.iloc[2]

col1   -2.018168
col2    0.740122
col3    0.528813
col4   -0.589001
Name: C, dtype: float64

In [92]:
df

          col1      col2      col3      col4
A     2.706850  0.628133  0.907969  0.503826
B     0.651118 -0.319318 -0.848077  0.605965
C    -2.018168  0.740122  0.528813 -0.589001
D     0.188695 -0.758872 -0.933237  0.955057
row5  0.190794  1.978757  2.605967  0.683509

In [93]:
df.iloc[0]

col1    2.706850
col2    0.628133
col3    0.907969
col4    0.503826
Name: A, dtype: float64

In [94]:
df.loc[['A','D'],['col1','col2']]

       col1      col2
A  2.706850  0.628133
D  0.188695 -0.758872

In [95]:
df

          col1      col2      col3      col4
A     2.706850  0.628133  0.907969  0.503826
B     0.651118 -0.319318 -0.848077  0.605965
C    -2.018168  0.740122  0.528813 -0.589001
D     0.188695 -0.758872 -0.933237  0.955057
row5  0.190794  1.978757  2.605967  0.683509

In [96]:
df > 0

       col1   col2   col3   col4
A      True   True   True   True
B      True  False  False   True
C     False   True   True  False
D      True  False  False   True
row5   True   True   True   True

In [97]:
df.drop('row5',inplace=True)

In [98]:
df

       col1      col2      col3      col4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [100]:
df.drop('col4',axis=1)

       col1      col2      col3
A  2.706850  0.628133  0.907969
B  0.651118 -0.319318 -0.848077
C -2.018168  0.740122  0.528813
D  0.188695 -0.758872 -0.933237

In [101]:
df.reset_index()

  index      col1      col2      col3      col4
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057

In [102]:
x=df.reset_index()

In [103]:
x['index']

0    A
1    B
2    C
3    D
Name: index, dtype: object

In [104]:
df.head(2)

       col1      col2      col3      col4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [109]:
newlis=' b c d e'.split()

In [110]:
newlis

['b', 'c', 'd', 'e']

In [111]:
d={'A':[2,3,np.nan],'B':[np.nan,7,np.nan],'C':[1,2,3]}

In [113]:
df=pd.DataFrame(d)

In [114]:
df

     A    B  C
0  2.0  NaN  1
1  3.0  7.0  2
2  NaN  NaN  3

In [116]:
df.dropna()

     A    B  C
1  3.0  7.0  2

In [117]:
df

     A    B  C
0  2.0  NaN  1
1  3.0  7.0  2
2  NaN  NaN  3

In [118]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [119]:
df

     A    B  C
0  2.0  NaN  1
1  3.0  7.0  2
2  NaN  NaN  3

In [120]:
df.dropna(thresh=2)

     A    B  C
0  2.0  NaN  1
1  3.0  7.0  2

In [122]:
df.fillna(value='nirmal')

        A       B  C
0       2  nirmal  1
1       3       7  2
2  nirmal  nirmal  3

In [126]:
df['A'].fillna(value=df['A'].mean())

0    2.0
1    3.0
2    2.5
Name: A, dtype: float64

In [129]:
# pip install sqlachemy
# do this in terminal

In [128]:
import sqlalchemy

In [133]:
data=pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [134]:
type(data)

list

In [141]:
data[0].head(6)

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","February 1, 2019"
1,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","February 21, 2018"
2,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","January 29, 2019"
3,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","March 22, 2018"
4,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017","January 29, 2019"
5,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,"March 3, 2017","January 29, 2019"

In [142]:
from sqlalchemy import create_engine

In [143]:
engine = create_engine('sqlite:///:memory:')